# Pandas Exercise  
  
## Part 1: Aggregation, Group By and Sort Review  
  
Below is a dataframe, with values as a list-of-lists and columns as a list.

In [1]:
import sys
print(f'System Version:\n{sys.version}')

System Version:
3.7.3 (default, Apr 24 2019, 15:29:51) [MSC v.1915 64 bit (AMD64)]

In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame([[123,'xt23',20],
                   [123,'q45',2],
                   [123,'a89',25],
                   [77,'q45',3],
                   [77,'a89',30],
                   [92,'xt23',24],
                   [92,'m33',60],
                   [92,'a89',28]], columns=['userid','product','price'])
df

   userid product  price
0     123    xt23     20
1     123     q45      2
2     123     a89     25
3      77     q45      3
4      77     a89     30
5      92    xt23     24
6      92     m33     60
7      92     a89     28

### Q: Find the maxiumu price anyone has paid

In [3]:
df['price'].max()

60

#### Q: Find the maximum price per user. Hint: Use groupby.

In [6]:
df.groupby(['userid'])['price'].max()

userid
77     30
92     60
123    25
Name: price, dtype: int64

#### Q: What is the total amount paid by the user?  
  
Note: Pandas will smartly leave out columns for which that aggregation doesn't have meaning.

In [9]:
df.groupby(['userid'])['price'].agg('sum').sort_values(ascending=False)

userid
92     112
123     47
77      33
Name: price, dtype: int64

#### Q: Sort the dataframe by userid first, then price, both ascending

In [19]:
df.sort_values(by=['userid','price'], ascending=[True, True])

   userid product  price
3      77     q45      3
4      77     a89     30
5      92    xt23     24
7      92     a89     28
6      92     m33     60
1     123     q45      2
0     123    xt23     20
2     123     a89     25

# Part 2: Combining Techniques  
  
### Q: We want the maximum price each user paid, and the product associated with that price.  
  
Note for SQL users: In SQL, you groupby and then sort, but in pandas, it's aesier to do it the other way around.

In [22]:
df.groupby(['userid'])['price']